Revit 2027 API
RadioButtonGroup Properties
The RadioButtonGroup type exposes the following members.
Properties
Name | Description
Current | Gets or sets the current checked ToggleButton of the RadioButtonGroup.
Enabled | Gets or sets a value indicating whether the item is enabled.
(Inherited from RibbonItem)
ItemText | Gets or sets the text displayed on the item.
(Inherited from RibbonItem)
ItemType | Gets the item type.
(Inherited from RibbonItem)
LongDescription |  Long description of the command tooltip
(Inherited from RibbonItem)
Name | The name of the item.
(Inherited from RibbonItem)
ToolTip | The description that appears as a ToolTip for the item.
(Inherited from RibbonItem)
ToolTipImage | The image to show as a part of the button extended tooltip
(Inherited from RibbonItem)
Visible | Gets or sets a value indicating whether the item is visible.
(Inherited from RibbonItem)
Top
See Also
Reference
RadioButtonGroup Class
Autodesk.Revit.UI Namespace